OdRxRefersToAttribute.parseReference(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject!System.Runtime.CompilerServices.IsConst*,=FUNC:OdSmartPtr&lt;OdRxPropertyBase&gt;(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced),=FUNC:System.Boolean(OdRxPropertyBase!System.Runtime.CompilerServices.IsConst*,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced))
\details
Parses the reference path returning the last property. E.g. for
"/BlockTableId/Items" it would be "Items" property of the block table.
\param path    [in]  Path to the property. Intermediate names are separated by '/'.
All the properties but the last should be dereferenceable (type().isReference() == true).
\param pObject [in]  The object to start with. Usually database, for paths starting with '/'.
\param find    [in]  Optional callback to customize the property retrieval. OdRxMemberQueryEngine::find() is used by default.
\param convert [in]  Optional callback to convert the property value to another type.
\returns
The last property in the path.

OdRxRefersToAttribute.path
\details
Gets the path to the related property.
\returns
Path to the related property (starting with database).
E.g. "/BlockTableId/Items" for OdDbEntity "BlockId" property.

OdRxRefersToAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute containing the provided path.
\param path [in]  Path to the related property (starting with database).
E.g. "/BlockTableId/Items" for OdDbEntity "BlockId" property.
\returns
Smart pointer to a constructed attribute object.